# 数据报告

## 问题：棒球运动员的薪水和哪些因素有关

我们假定棒球运动员的薪水与以下几个因素密切相关

- 时间（以年份计算）

- 年龄

- 出场次数

- 场上表现（击球，防守）

- 管理者的薪水和排名

- 球队

##  1. 球员薪水随时间变化

### 1.1 导入`Salaries.csv`数据

In [58]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

# mastersFileName = './baseballdatabank-2017.1/core/Master.csv'
# mastersDF = pd.read_csv(mastersFileName)
# mastersDF.head()

salariesFileName = './baseballdatabank-2017.1/core/Salaries.csv'
salariesDF = pd.read_csv(salariesFileName)

In [59]:
# 查看每一列的数据类型
salariesDF.dtypes

yearID       int64
teamID      object
lgID        object
playerID    object
salary       int64
dtype: object

In [60]:
# 查看前几行数据
salariesDF.head()

   yearID teamID lgID   playerID  salary
0    1985    ATL   NL  barkele01  870000
1    1985    ATL   NL  bedrost01  550000
2    1985    ATL   NL  benedbr01  545000
3    1985    ATL   NL   campri01  633333
4    1985    ATL   NL  ceronri01  625000

In [61]:
# 描述数据分布情况
salariesDF.describe()

             yearID        salary
count  26428.000000  2.642800e+04
mean    2000.878727  2.085634e+06
std        8.909314  3.455348e+06
min     1985.000000  0.000000e+00
25%     1994.000000  2.947020e+05
50%     2001.000000  5.500000e+05
75%     2009.000000  2.350000e+06
max     2016.000000  3.300000e+07

### 1.2 整理`Salaries.csv`数据

查看薪水数据里面有没有null值：

In [62]:
pd.isnull(salariesDF).sum()

yearID      0
teamID      0
lgID        0
playerID    0
salary      0
dtype: int64

由于没有发现null值，我们无需对这种情况进行任何处理。

接下来，检查薪水数据里面有没有0或者负数：

In [63]:
salariesDF[salariesDF["salary"] <= 0]

       yearID teamID lgID   playerID  salary
6179     1993    NYA   AL  jamesdi01       0
12007    1999    PIT   NL  martija02       0